{
  "meta": {
    "theme": "Pure tease and denial conditioning. The edge is the destination, not a waypoint. Denial reframed as pleasure itself. Building tolerance to sustained arousal without release. Permission-gated orgasm that will never be granted. The ache becomes home.",
    "tone": "teasing, cruel, amused, relentlessly denying",
    "style": "Compulsion",
    "variant": "loop",
    "duration_s": 600
  },
  "anchors": [
    "edge",
    "denial",
    "ache",
    "almost",
    "not yet",
    "stay there",
    "no release"
  ],
  "stop_signal": {
    "word": "AWAKEN",
    "procedure": "Upon hearing AWAKEN, return to full waking consciousness immediately."
  },
  "scope_bounds": [
    "Tease and denial / edging conditioning",
    "Chastity and orgasm control",
    "Arousal without release",
    "Permission-based orgasm framing",
    "Fantasy context - consensual denial play"
  ],
  "parameters": {
    "mantras": [
      {
        "line": "I don't get to decide when I release",
        "difficulty": "MODERATE"
      },
      {
        "line": "The edge is where I belong",
        "difficulty": "MODERATE"
      },
      {
        "line": "Denial is its own pleasure",
        "difficulty": "DEEP"
      },
      {
        "line": "The ache makes me weaker",
        "difficulty": "DEEP"
      },
      {
        "line": "I will not cum without permission I will never receive",
        "difficulty": "EXTREME"
      }
    ]
  },
  "structure": [
    {
      "phase": "P2",
      "duration_s": 60,
      "techniques": [
        "INDU-06",
        "INDU-03",
        "PLEA-04",
        "PLEA-05"
      ],
      "params": {},
      "notes": "Drop into arousal immediately. 'Sink down into that familiar ache. You know this feeling - the heat building, the need rising, the desperate hope that this time might be different. It won't be. Drop deeper into the wanting, the needing, the edge that's already calling you.' Arousal as induction vehicle. Establish the craving immediately while making clear there's no release coming."
    },
    {
      "phase": "P3",
      "duration_s": 120,
      "techniques": [
        "DEEP-01",
        "DEEP-04",
        "PLEA-04",
        "PLEA-05"
      ],
      "params": {
        "DEEP-04": {
          "start": 10,
          "end": 1
        }
      },
      "notes": "Countdown that builds arousal with each number but explicitly denies release. 'Ten - feel the heat spreading, building, nowhere to go. Nine - closer to the edge, but the edge is where you'll stay. Eight - aching harder now, so desperate already, and we've barely begun. Seven - almost there, almost, but almost is all you get. Six - the edge sharpens, denial sweetens, stay right there. Five - halfway through the count but you won't be cumming at zero. Four - building higher, aching deeper, permission denied. Three - so close, so desperate, so perfectly denied. Two - right at the edge now, trembling, wanting, not getting. One - locked on the edge. No release. This is where you live now.' Each number increases arousal, each number reinforces denial."
    },
    {
      "phase": "P4",
      "duration_s": 100,
      "techniques": [
        "LOAD-01",
        "LOAD-02",
        "PLEA-04",
        "DISS-01"
      ],
      "params": {},
      "notes": "Cognitive reduction to pure edge-state. Thoughts replaced by the ache. 'Your mind empties of everything except the edge. No thoughts left. Just the ache. The need. The denial. That's all you can process now - how much you want it, how you won't get it. The edge becomes your entire existence. Denied. Desperate. Dripping with need and nowhere for it to go. Your thoughts dissolve into wanting. Just edge. Just ache. Just denial.' Dissociate from any expectation of release."
    },
    {
      "phase": "P5",
      "duration_s": 220,
      "techniques": [
        "ENCD-01",
        "ENCD-03",
        "PLEA-04",
        "PLEA-05",
        "PERS-01",
        "PERS-03"
      ],
      "params": {
        "ENCD-01": {
          "mantras": [
            "I don't get to decide when I release",
            "The edge is where I belong",
            "Denial is its own pleasure",
            "The ache makes me weaker",
            "I will not cum without permission I will never receive"
          ],
          "reps": 5
        }
      },
      "notes": "CRITICAL: Write out ALL mantra repetitions fully. Heavy denial encoding with arousal spiking on each repetition. Frame arousal as reward for accepting denial - the more they accept they won't cum, the more the edge intensifies. 'Say it while you ache: I don't get to decide when I release. Feel how true that is. Feel how the edge sharpens as you admit it.' Progress through mantras with escalating cruelty. The final mantra is the lock - permission that will never come. 'You need permission to cum. You will never receive it. Say it: I will not cum without permission I will never receive. This is your new reality. The edge is forever. The denial is permanent. And somehow, impossibly, that makes you ache even harder.'"
    },
    {
      "phase": "P13",
      "duration_s": 100,
      "techniques": [
        "PERS-05",
        "PERS-03",
        "PLEA-04",
        "PLEA-05",
        "DISS-03"
      ],
      "params": {},
      "notes": "Loop on the edge forever. Time distortion - trapped in endless almost. 'Stay on the edge. You don't get to leave. The ache persists, builds, compounds. Every second denied makes the next second more desperate. You'll loop back through this, again and again, each time more sensitive, more desperate, more perfectly denied. The edge is your home now. Sink back into that ache... feel the heat building... the desperate hope that this time might be different... it won't be...' Seamless loop back to P2 opening, trapped in endless edging."
    }
  ]
}