{
  "meta": {
    "theme": "Extended free use conditioning with three-wave escalation. Fractionation between waves deepens ownership transfer. Wave 1 plants seeds of availability. Wave 2 grows ownership and denial. Wave 3 harvests with full identity encoding. Each cycle listener goes under feeling more owned than before.",
    "tone": "escalating from permissive to demanding, building objectification, relentless by wave 3",
    "style": "Compulsion",
    "variant": "loop",
    "duration_s": 1200
  },
  "anchors": [
    "available",
    "use me",
    "take me",
    "theirs",
    "ready",
    "need",
    "empty until filled"
  ],
  "stop_signal": {
    "word": "AWAKEN",
    "procedure": "Upon hearing AWAKEN, return to full waking consciousness immediately."
  },
  "scope_bounds": [
    "Free use / CNC fantasy conditioning",
    "Body availability and objectification",
    "Implied chastity - denial builds need",
    "Generic 'they/them' - not tied to specific person",
    "Fantasy context - consensual roleplay framework",
    "Three-wave escalation: soft → medium → full"
  ],
  "parameters": {
    "mantras": [
      {
        "line": "My body is not my own",
        "difficulty": "MODERATE"
      },
      {
        "line": "I exist to be used",
        "difficulty": "MODERATE"
      },
      {
        "line": "I am always available",
        "difficulty": "DEEP"
      },
      {
        "line": "Denial makes me needier",
        "difficulty": "DEEP"
      },
      {
        "line": "I am nothing until I am taken",
        "difficulty": "EXTREME"
      }
    ]
  },
  "structure": [
    {
      "phase": "P2",
      "duration_s": 50,
      "techniques": [
        "INDU-06",
        "INDU-03",
        "PLEA-03"
      ],
      "params": {},
      "notes": "Gentle opening. 'Sink down into this space where you can let go. A place where you don't have to hold on so tight. Where it feels good to be... available. Ready. Open.' Permissive framing, planting first seeds without force."
    },
    {
      "phase": "P3",
      "duration_s": 90,
      "techniques": [
        "DEEP-01",
        "DEEP-04",
        "PLEA-01"
      ],
      "params": {
        "DEEP-04": {
          "start": 10,
          "end": 1
        }
      },
      "notes": "Standard deepening countdown. Each number relaxes more, opens more. Light suggestion that 'letting go feels natural, being ready feels right.' No heavy ownership language yet - just comfort with availability."
    },
    {
      "phase": "P4",
      "duration_s": 60,
      "techniques": [
        "LOAD-01",
        "LOAD-02",
        "SEMN-03"
      ],
      "params": {},
      "notes": "WAVE 1 REDUCTION: Light thought quieting. 'Thoughts slow... mind softens... just feel how nice it is to wait. To be ready. Available.' Introduce the waiting, the readiness, but gently."
    },
    {
      "phase": "P5",
      "duration_s": 80,
      "techniques": [
        "ENCD-03",
        "ENCD-06",
        "PLEA-03",
        "AUTH-07"
      ],
      "params": {},
      "notes": "WAVE 1 SUGGESTION: NO FULL MANTRAS. Use layered repetition and compliance loops instead. 'Available... ready... waiting feels peaceful... being open feels freeing... there's relief in not having to decide...' Reframe availability as freedom (AUTH-07 philosophical conditioning). Plant the concepts through varied phrasing, not drilling. Soft surrender-as-freedom framing."
    },
    {
      "phase": "P8",
      "duration_s": 70,
      "techniques": [
        "DEEP-03",
        "DEEP-01",
        "INDU-06"
      ],
      "params": {},
      "notes": "FRACTIONATION 1: Bring them partially up. 'Rising slightly now... becoming a little more aware... notice how good that openness felt... how natural it was to wait, to be ready...' Then drop them back down DEEPER. 'And now drop twice as deep. Twice as available. Twice as ready.' The contrast makes the availability feel more owned."
    },
    {
      "phase": "P4",
      "duration_s": 70,
      "techniques": [
        "LOAD-01",
        "LOAD-02",
        "DISS-01",
        "AUTH-05"
      ],
      "params": {},
      "notes": "WAVE 2 REDUCTION: Deeper emptying. 'Mind quieter now... thoughts fading further... starting to feel less like yours... your body knows what it is even if your mind hasn't caught up...' Begin introducing ownership transfer to the body itself."
    },
    {
      "phase": "P5",
      "duration_s": 100,
      "techniques": [
        "ENCD-02",
        "ENCD-04",
        "PLEA-04",
        "PERS-03"
      ],
      "params": {
        "ENCD-02": {
          "phrases": [
            "My body is not my own",
            "I exist to be used"
          ],
          "reps": 2
        }
      },
      "notes": "WAVE 2 SUGGESTION: Call-and-response with first two mantras, but only 2 reps each. 'Say it with me: My body is not my own. Feel that truth settle. Again: My body is not my own.' Then future pacing (ENCD-04): 'Every time you feel that waiting feeling, you'll remember - your body isn't yours to decide.' Introduce the chastity angle: arousal acknowledged but framed as building, waiting for someone else to decide. Progressive conditioning - 'each time deeper, each time more true.'"
    },
    {
      "phase": "P8",
      "duration_s": 70,
      "techniques": [
        "DEEP-03",
        "DEEP-01",
        "INDU-06"
      ],
      "params": {},
      "notes": "FRACTIONATION 2: Bring up again. 'Rising once more... feel how much deeper you are than before... how much more owned you feel already... the truth settling into your body...' Drop even deeper. 'And drop. Three times as deep now. Your body knows what it is. It's remembering. It's becoming.' Each surface makes the ownership more conscious, each drop makes it more embodied."
    },
    {
      "phase": "P4",
      "duration_s": 80,
      "techniques": [
        "LOAD-01",
        "LOAD-02",
        "DISS-01",
        "AUTH-04"
      ],
      "params": {},
      "notes": "WAVE 3 REDUCTION: Complete erasure. Full objectification language now. 'No more thoughts. You're not a person right now. Just a body. Available. Theirs. Empty until filled. Waiting until taken. That's all you are. That's all you need to be.' The previous waves prepared them for this."
    },
    {
      "phase": "P5",
      "duration_s": 220,
      "techniques": [
        "ENCD-01",
        "ENCD-03",
        "PLEA-04",
        "PLEA-05",
        "PERS-01",
        "PERS-03"
      ],
      "params": {
        "ENCD-01": {
          "mantras": [
            "My body is not my own",
            "I exist to be used",
            "I am always available",
            "Denial makes me needier",
            "I am nothing until I am taken"
          ],
          "reps": 5
        }
      },
      "notes": "WAVE 3 FULL ENCODING: NOW all 5 mantras, 5 reps each. This is the harvest. Write out ALL repetitions fully. Start with the familiar ones from Wave 2 to build momentum, then escalate to the DEEP and EXTREME mantras. 'You've said it before and it was true then. It's more true now. Say it: My body is not my own...' Build through all five with increasing intensity. The chastity lock: 'Denial makes me needier' paired with 'only being taken releases you.' Identity seal with PERS-01: 'This is who you are now. This is what you've always been. Available. Ready. Theirs.'"
    },
    {
      "phase": "P13",
      "duration_s": 110,
      "techniques": [
        "PERS-05",
        "PERS-03",
        "PLEA-05",
        "ENCD-04",
        "DISS-03"
      ],
      "params": {},
      "notes": "Loop maintenance with timelessness. 'You stay in this place. Available. Waiting. The need doesn't stop, it only grows. Each moment you aren't being used, the ache deepens. This is your existence now - the waiting, the readiness, the need.' Time distortion - endless waiting. Generic loop transition: 'Sink back down into that space... where you can let go... where it feels good to be available... ready... open...' Connect back to P2 opening tone but now it means so much more."
    }
  ]
}